In [ ]:
# 결합, 결측값(NaN) 처리, 중복 처리를 다룬다

In [3]:
# Heand and tail 
import pandas as pd
import numpy as np

data = pd.Series(np.random.randn(1000))
print(data.head())  # 위에서 5행 print 
print("\n")
print(data.tail()) # 아래에서 5행 print

0    0.555404
1   -0.225012
2   -0.765466
3   -0.115303
4   -1.114375
dtype: float64


995    0.434213
996   -0.837277
997   -0.275684
998   -1.329821
999    2.939367
dtype: float64

In [5]:
df= pd.DataFrame({
   ....:         "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
   ....:         "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
   ....:         "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
   ....:     }
)
df

        one       two     three
a  0.074882  1.015345       NaN
b  0.955098  0.148582  1.127947
c  0.586822  0.640013  3.224907
d       NaN  0.791147 -0.120165

In [8]:
row = df.iloc[0]  # 첫번째 행 가져오기
print(row)
print("\n")
column = df["one"] # 첫번째 열 가져오기 
print(column)

one      0.074882
two      1.015345
three         NaN
Name: a, dtype: float64


a    0.074882
b    0.955098
c    0.586822
d         NaN
Name: one, dtype: float64

In [45]:
# Combining data
#  CONCAT 

import pandas as pd 
import numpy as np

df1 = pd.DataFrame({'a':['a0','a1','a2','a3'],
                   'b':['b0','b1','b2','b3'],
                   'c':['c0','c1','c2','c3']},
                  index = [0,1,2,3])  # 4 X 3 metrix


df2 = df2 = pd.DataFrame({'a':['a0','y','z','h'],
                   'b':['b0','b1','b2','b3'],
                   'c':['c0','y2','z2','h2'],
                   'd':['d0','y3','z3','h3']},
                   index = ["영","일","이","삼"]) # 4  X 4 metrix

print(df1, "\n")
print(df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

    a   b   c   d
영  a0  b0  c0  d0
일   y  b1  y2  y3
이   z  b2  z2  z3
삼   h  b3  h2  h3

In [46]:
result1 = pd.concat([df1,df2], axis= 0)  # 행 방향으로 이어붙이기 
print(result1)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
영  a0  b0  c0   d0
일   y  b1  y2   y3
이   z  b2  z2   z3
삼   h  b3  h2   h3

In [47]:
result2 = pd.concat([df1,df2],ignore_index = True)  #  인덱스를 정리해어 붙이기
print(result2)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a0  b0  c0   d0
5   y  b1  y2   y3
6   z  b2  z2   z3
7   h  b3  h2   h3

In [48]:
result3 = pd.concat([df1,df2],axis=1) # 열방향으로 가져오기 
print(result3)

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2  NaN  NaN  NaN  NaN
3   a3   b3   c3  NaN  NaN  NaN  NaN
삼  NaN  NaN  NaN    h   b3   h2   h3
영  NaN  NaN  NaN   a0   b0   c0   d0
이  NaN  NaN  NaN    z   b2   z2   z3
일  NaN  NaN  NaN    y   b1   y2   y3

In [ ]:
# merge는 공통의 열을 기준으로 두 데이터 프레임을 합쳐준다 

# 기준열 이름이 같을 때 
# pd.merge(left, right, on = '기준열', how = '조인방식')

# 기준열 이름이 다를 때
# pd.merge(left, right, left_on = '왼쪽 열', right_on = '오른쪽 열', how = '조인방식')

# 조인방식 (left, right, inner, outer)  이 있고 inner가 default

In [50]:
Fruit = pd.DataFrame({"Number":[1,2,3,4,5],"Fruit":['Apple', 'Banana', 'Cherry', 'Lemon', 'Peach']})

Grade = pd.DataFrame({"Number":[1,2,3], "Grade":["A","B","C"]})

print(Fruit,"\n")
print(Grade)

# 두 개의 df 는 Number 라는 열을 공통으로 가진다.

   Number   Fruit
0       1   Apple
1       2  Banana
2       3  Cherry
3       4   Lemon
4       5   Peach

   Number Grade
0       1     A
1       2     B
2       3     C

In [53]:
# Left Join  왼쪽 데이터프레임을 기준으로  조인하기

# pd.merge(left, right, on = "기준열", how = "left")

pd.merge(Fruit, Grade, on = "Number", how = "left")

   Number   Fruit Grade
0       1   Apple     A
1       2  Banana     B
2       3  Cherry     C
3       4   Lemon   NaN
4       5   Peach   NaN

In [54]:
# Right join 오른쪽 데이터프레임을 기준으로 조인하기 
# pd.merge(left, right, on = "기준열", how = "right")

pd.merge(Fruit,Grade,on = "Number",how = "right")

   Number   Fruit Grade
0       1   Apple     A
1       2  Banana     B
2       3  Cherry     C

In [56]:
# inner join  교집합으로 양쪽에 공통으로 있는 값만 나타낸다
# pd.merge(left, right, on = '기준열', how = 'inner')
pd.merge(Fruit,Grade, on = "Number", how = "inner")

   Number   Fruit Grade
0       1   Apple     A
1       2  Banana     B
2       3  Cherry     C

In [58]:
# outer join 합집합 
# pd.merge(left, right, on = "기준열", how = "outer")
pd.merge(Fruit, Grade, on = "Number", how = "outer")

   Number   Fruit Grade
0       1   Apple     A
1       2  Banana     B
2       3  Cherry     C
3       4   Lemon   NaN
4       5   Peach   NaN

In [61]:
# 공통이 되는 기준열이 여러개 일 때 
# pd.merge(left, right, on = [기준열1,기준열2...])

Fruit = pd.DataFrame({"Number":[1,2,3,4,5],"Fruit":['Apple', 'Banana', 'Cherry', 'Lemon', 'Peach']})

Grade = pd.DataFrame({"Number":[1,2,3], "Fruit":['Apple', 'Banana', 'Cherry'],"Grade":["A","B","C"]})

print(Fruit, "\n")
print(Grade)

   Number   Fruit
0       1   Apple
1       2  Banana
2       3  Cherry
3       4   Lemon
4       5   Peach

   Number   Fruit Grade
0       1   Apple     A
1       2  Banana     B
2       3  Cherry     C

In [68]:
left_merge = pd.merge(Fruit, Grade, on= ["Number", "Fruit"], how = "left")
right_merge = pd.merge(Fruit, Grade, on =["Number", "Fruit"], how = "right")
inner_merge = pd.merge(Fruit, Grade, on =["Number", "Fruit"], how = "inner")
outer_merge = pd.merge(Fruit, Grade, on =["Number", "Fruit"], how = "outer")

print(left_merge)

   Number   Fruit Grade
0       1   Apple     A
1       2  Banana     B
2       3  Cherry     C
3       4   Lemon   NaN
4       5   Peach   NaN

In [69]:
print(right_merge)

   Number   Fruit Grade
0       1   Apple     A
1       2  Banana     B
2       3  Cherry     C

In [71]:
# 두 df의 열 이름이 다를 때 
# pd.merge(left, right, left_on = '왼쪽 열', right_on = '오른쪽 열')



Fruit = pd.DataFrame({"Number":[1,2,3,4,5],"Fruit":['Apple', 'Banana', 'Cherry', 'Lemon', 'Peach']})

Grade = pd.DataFrame({"순서":[1,2,3], "Grade":["A","B","C"], "Price":[100,200,300]})

In [74]:
pd.merge(Fruit, Grade, left_on = "Fruit",right_on= "Grade", how="left")

   Number   Fruit  순서 Grade  Price
0       1   Apple NaN   NaN    NaN
1       2  Banana NaN   NaN    NaN
2       3  Cherry NaN   NaN    NaN
3       4   Lemon NaN   NaN    NaN
4       5   Peach NaN   NaN    NaN

In [75]:
pd.merge(Fruit, Grade, left_on = "Fruit",right_on= "Grade", how="right")

   Number Fruit  순서 Grade  Price
0     NaN   NaN   1     A    100
1     NaN   NaN   2     B    200
2     NaN   NaN   3     C    300

In [83]:
# 결측치(NaN), 중복데이터 처리하기 

import seaborn as sns 
import pandas as pd 
import numpy as np 

df = pd.read_csv("C:\\Users\\yuna\Downloads\\titanic\\test.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [85]:
df.info() # 데이터를 간단히 살펴보기 
# 총 11개의 columns , 418개의 rows, "AGE", "CABIN","FARE" 가 결측치(NaN)을 가지고 있다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [93]:
print(df["Age"].value_counts,"\n")
print("dropna를 추가했을때")
print(df["Age"].value_counts(dropna= False))  # Dropna = False 를 하면 Nan 값을 추가해서 카운트해줌

<bound method IndexOpsMixin.value_counts of 0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64>

dropna를 추가했을때
NaN     86
24.0    17
21.0    17
22.0    16
30.0    15
        ..
67.0     1
11.5     1
34.5     1
28.5     1
60.5     1
Name: Age, Length: 80, dtype: int64

In [94]:
# isnull()  & notnull() 을 사용하면은 결측치(NaN)에 대해서 true/false 를 돌려줌 

df.head().isnull()  # NaN일 때 True 반환

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,True,False

In [95]:
df.head().notnull() # NaN일 때 False 반환

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,True,True,True,True,True,True,True,True,True,False,True
1,True,True,True,True,True,True,True,True,True,False,True
2,True,True,True,True,True,True,True,True,True,False,True
3,True,True,True,True,True,True,True,True,True,False,True
4,True,True,True,True,True,True,True,True,True,False,True

In [100]:
# dropna 를 통해 결측치를 제거해보자 

df.dropna(axis=0).info()  # NaN 이 있는 행은 제거해서 87개 만 줄어든 것을 볼 수 있음

<class 'pandas.core.frame.DataFrame'>
Int64Index: 87 entries, 12 to 414
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  87 non-null     int64
 1   Pclass       87 non-null     int64
 2   Name         87 non-null     object
 3   Sex          87 non-null     object
 4   Age          87 non-null     float64
 5   SibSp        87 non-null     int64
 6   Parch        87 non-null     int64
 7   Ticket       87 non-null     object
 8   Fare         87 non-null     float64
 9   Cabin        87 non-null     object
 10  Embarked     87 non-null     object
dtypes: float64(2), int64(4), object(5)
memory usage: 8.2+ KB

In [99]:
df.dropna(axis=1).info()  # axis = 1을 하면 NaN 이 존재하는 열은 삭제해 버려서 컬럼수가 11개에서 8개로 줄어듬

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Ticket       418 non-null    object
 7   Embarked     418 non-null    object
dtypes: int64(4), object(4)
memory usage: 26.2+ KB

In [103]:
# thresh = xx   ( 결측치가 xx 이상인 행 또는 열을 모두 삭제해 버림)

df_thresh = df.dropna(axis = 1, thresh = 100)  # 결측치가 100개 이상인 열이었던 Cabin 삭제
df_thresh.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 32.8+ KB

In [112]:
# subset = ["열"] 옵션 
# 열 옵션에 결측값이 1개라도 있으면 그 행을 drop시키자 
df_age = df.dropna(subset = ["Age"], how = "any", axis = 0)
# 만약 how 가 all 이면은 NaN이 모든 열 또는 행에 존재해야함 

print(len(df_age),"\n") # NaN이 없는, 값만 들어있는 행들 
print(df_age["Age"].isnull().sum())

332

0

In [ ]:
# 누락데이터 치환 fillna()
# NaN 값을 제거하지 않고 다른 값으로 대체하자

In [115]:
import seaborn as sns 

df = pd.read_csv("C:\\Users\\yuna\Downloads\\titanic\\test.csv")

In [122]:
print("*** 변경 전 ***")
print(df["Age"].head(30))
mean_age = df["Age"].mean()   # Age의 평균값을 만들기 
df["Age"].fillna(mean_age,inplace = True)# 평균값으로 대체하기 
print("\n")
print("*** 평균 값 ***")
print(mean_age)
print("\n")
print("*** 변경 후 *** ")
print(df["Age"].head(30))

*** 변경 전 ***
0     34.50000
1     47.00000
2     62.00000
3     27.00000
4     22.00000
5     14.00000
6     30.00000
7     26.00000
8     18.00000
9     21.00000
10    30.27259
11    46.00000
12    23.00000
13    63.00000
14    47.00000
15    24.00000
16    35.00000
17    21.00000
18    27.00000
19    45.00000
20    55.00000
21     9.00000
22    30.27259
23    21.00000
24    48.00000
25    50.00000
26    22.00000
27    22.50000
28    41.00000
29    30.27259
Name: Age, dtype: float64


*** 평균 값 ***
30.272590361445815


*** 변경 후 ***
0     34.50000
1     47.00000
2     62.00000
3     27.00000
4     22.00000
5     14.00000
6     30.00000
7     26.00000
8     18.00000
9     21.00000
10    30.27259
11    46.00000
12    23.00000
13    63.00000
14    47.00000
15    24.00000
16    35.00000
17    21.00000
18    27.00000
19    45.00000
20    55.00000
21     9.00000
22    30.27259
23    21.00000
24    48.00000
25    50.00000
26    22.00000
27    22.50000
28    41.00000
29    30.27259
Name: Age, dtype: float64

In [136]:
print(df["Fare"].value_counts())
print('\n')
print("***결측치갯수***")
print(df["Fare"].isnull().sum())

7.7500      21
26.0000     19
8.0500      17
13.0000     17
7.8958      11
            ..
31.6833      1
16.0000      1
53.1000      1
146.5208     1
20.2500      1
Name: Fare, Length: 169, dtype: int64


***결측치갯수***
1

In [137]:
# 결측치 1개가 어느 index, row에 있는지 확인해보기 

df.index[df["Fare"].isnull()]   # 152행에 NaN이 있다고 나와 있음

Int64Index([152], dtype='int64')

In [139]:
# 확인해보자 
df.iloc[152]

PassengerId                  1044
Pclass                          3
Name           Storey, Mr. Thomas
Sex                          male
Age                          60.5
SibSp                           0
Parch                           0
Ticket                       3701
Fare                          NaN
Cabin                         NaN
Embarked                        S
Name: 152, dtype: object

In [142]:
# Fare 의 NaN 값을 최빈값으로 대체해보자 
# idxmax() 는 최대갯수 값을 가지는 index를 불러와줌
most_freq = df["Fare"].value_counts(dropna= True).idxmax()  # dropna = False를 하면은 NaN값도 같이 불러오기 때문에 , dropna = True인 default 값을 불러오자
most_freq  # 최빈값은  7.75

7.75

In [144]:
df["Fare"].fillna(most_freq, inplace = True)
df.iloc[152] # NaN값이었던 Fare가 7.75로 바뀐것을 볼 수 있음

PassengerId                  1044
Pclass                          3
Name           Storey, Mr. Thomas
Sex                          male
Age                          60.5
SibSp                           0
Parch                           0
Ticket                       3701
Fare                         7.75
Cabin                         NaN
Embarked                        S
Name: 152, dtype: object

In [147]:
# NaN의 값을 이웃값으로 대체해 보기 
# method = "ffill" 은 NaN의 바로의 값으로, method = "bfill"의 NaN의 뒤의 값으로 변경
import seaborn as sns 
df = pd.read_csv("C:\\Users\\yuna\Downloads\\titanic\\test.csv")

print("*** 변경 전 ***")
print(df["Fare"][150:155])
print("\n")

print("*** NaN 이전 값으로 변경하기 *** ")
df["Fare"].fillna(method = "ffill", inplace = True)
print(df["Fare"][150:155])

*** 변경 전 ***
150    83.1583
151     7.8958
152        NaN
153    12.1833
154    31.3875
Name: Fare, dtype: float64


*** NaN 이전 값으로 변경하기 ***
150    83.1583
151     7.8958
152     7.8958
153    12.1833
154    31.3875
Name: Fare, dtype: float64

In [148]:
# 중복 데이터 
# 중복 데이터 탐색 

import pandas as pd 
df = pd.DataFrame({'c1' : ['a','a', 'b', 'a', 'b'],
                  'c2' : [1, 1, 1, 2, 2],
                   'c3' : [1, 1, 2, 2, 2]})

df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [149]:
# duplicated()
# 전에 나온 행들과 비교하여 중복되는 행이면 True, 아니면 False
# 첫 번째(0번째) 값은 항상 False
# 바로 전 행과만 비교하는게 아니라 처음 나오는 행인지, 나왔던 행인지를 비교
# 즉, False의 개수가 유니크한 값의 개수

df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [151]:
col_2 = df["c2"].duplicated()
col_2

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

In [150]:
# Series에서도 적용이 가능 
test = pd.Series([3,1,2,1,2,2,3,])
test.duplicated()

0    False
1    False
2    False
3     True
4     True
5     True
6     True
dtype: bool

In [152]:
# 중복 데이터 제거 
# drop_duplicates()

import pandas as pd 

df = pd.DataFrame({'c1' : ['a','a', 'b', 'a', 'b'],
                  'c2' : [1, 1, 1, 2, 2],
                   'c3' : [1, 1, 2, 2, 2]})

df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [153]:
# duplicated()는 중복행을 탐색 하는 작업이라면, 
# drop_duplicates() 중복행을 제거해 주는 역할 

df2 = df.drop_duplicates()
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [157]:
# subset = [열1, 열2..] 특정열을 기준으로 중복행 제거 
print(df)
print("\n")
print("*** 콜럼 c2, c3를 기준으로 중복 열 제거해주기 *** ")

df3 = df.drop_duplicates(subset = ["c2","c3"])
print(df3) # 행 1,4행이 0, 3행과 중복되었다는 것을 알 수 있음

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2


*** 콜럼 c2, c3를 기준으로 중복 열 제거해주기 ***
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2